
const skillList = {
    pikachu: ["でんこうせっか", "サンダーボルト", "かみなり", "放電"],
    mokurou: ["葉っぱカッター", "体当たり", "草の呼吸","羽交い締め"],
    mimikkyu: ["シャドークロウ", "じゃれつく", "身代わり","あやしいひかり"]
};

const skills = {
    "でんこうせっか": { damage: 10 },
    "サンダーボルト": { damage: 20 },
    "放電": { damage: 50 },
    "かみなり": { damage: 30 },
    "葉っぱカッター": { damage: 50 },
    "体当たり": { damage: 10 },
    "草の呼吸": { damage: 25 },
    "羽交い締め": { damage: 18 },
    "シャドークロウ": { damage: 18 },
    "じゃれつく": { damage: 33 },
    "身代わり": { damage: 0 },
    "あやしいひかり": { damage: 30 }
};